devdnl/dnx-rtos/src/system/drivers/uart/stm32f1/uart.c
                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &UART_mem[major]->port_lock_rx_mtx);
                if (err != ESUCC)
                        goto finish;

                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &UART_mem[major]->port_lock_tx_mtx);
                if (err != ESUCC)
                        goto finish;

                err = UART_turn_on(&UART[major]);
                if (err == ESUCC) {
                        UART_mem[major]->major  = major;
                        UART_mem[major]->config = UART_DEFAULT_CONFIG;
                        NVIC_EnableIRQ(UART[major].IRQn);
                        NVIC_SetPriority(UART[major].IRQn, UART[major].PRIORITY);
                        UART_configure(major, &UART_DEFAULT_CONFIG);
                }

                finish:
                if (err != ESUCC) {
                        if (UART_mem[major]->port_lock_tx_mtx)
                                sys_mutex_destroy(UART_mem[major]->port_lock_tx_mtx);

                        if (UART_mem[major]->port_lock_rx_mtx)
                                sys_mutex_destroy(UART_mem[major]->port_lock_rx_mtx);

                        if (UART_mem[major]->data_write_sem)
                                sys_semaphore_destroy(UART_mem[major]->data_write_sem);

                        if (UART_mem[major]->data_write_sem)
                                sys_semaphore_destroy(UART_mem[major]->data_write_sem);

                        sys_free(device_handle);
                        UART_mem[major] = NULL;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(UART, void *device_handle)
{
        struct UART_mem *hdl = device_handle;

        if (sys_mutex_lock(hdl->port_lock_rx_mtx, RELEASE_TIMEOUT) == ESUCC) {
                if (sys_mutex_lock(hdl->port_lock_tx_mtx, RELEASE_TIMEOUT) == ESUCC) {

                        sys_mutex_destroy(hdl->port_lock_rx_mtx);
                        sys_mutex_destroy(hdl->port_lock_tx_mtx);

                        sys_semaphore_destroy(hdl->data_write_sem);

                        UART_turn_off(&UART[hdl->major]);

                        UART_mem[hdl->major] = NULL;
                        sys_free(device_handle);

                        return ESUCC;
                }

                sys_mutex_unlock(hdl->port_lock_rx_mtx);
        }

        return EBUSY;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(UART, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(UART, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(UART,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG2(fpos, fattr);

        struct UART_mem *hdl = device_handle;

        int err = sys_mutex_lock(hdl->port_lock_tx_mtx, MTX_BLOCK_TIMEOUT);
        if (err == ESUCC) {
                hdl->Tx_buffer.src_ptr   = src;
                hdl->Tx_buffer.data_size = count;

                SET_BIT(UART[hdl->major].UART->CR1, USART_CR1_TXEIE);

                err = sys_semaphore_wait(hdl->data_write_sem, TX_WAIT_TIMEOUT);
                if (err == ESUCC) {
                        *wrcnt = count - hdl->Tx_buffer.data_size;
                }

                sys_mutex_unlock(hdl->port_lock_tx_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(UART,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG2(fpos, fattr);

        struct UART_mem *hdl = device_handle;

